Rocontento/HomeKey-ESP32/main/NfcManager.cpp
#include "NfcManager.hpp"
#include "ReaderDataManager.hpp"
#include "ddk/homekey/ProfileFactory.h"
#include "ddk/session/AuthOutcome.h"
#include "ddk/session/Flow.h"
#include "ddk/session/Session.h"
#include "ddk/store/CredentialStore.h"
#include "ddk/transport/NfcChannel.h"
#include "esp32-hal.h"
#include "esp_log_buffer.h"
#include "esp_log_level.h"
#include "eventStructs.hpp"
#include "fmt/ranges.h"
#include "freertos/idf_additions.h"
#include "Pn532Reader.hpp"
#include "Pn7160Reader.hpp"
#include "St25r3916Reader.hpp"
#include "hal/gpio_types.h"
#include "RfQuietWindow.hpp"
#include "utils.hpp"

#include <array>
#include <cstdint>
#include <esp_log.h>
#include <chrono>
#include <functional>
#include <memory>
// See eventStructs.hpp: alpaca crc32 platform-detection workaround.
#ifndef __gnu_linux__
#define __gnu_linux__
#endif
#include "alpaca/alpaca.h"

const char* NfcManager::TAG = "NfcManager";

static const uint8_t ECP_HEAD[] = { 0x6A, 0x2, 0xCB, 0x2, 0x6, 0x2, 0x11, 0x00 };

void NfcManager::invalidateAuthCache() {
  if (!m_hkAuthPrecomputeEnabled) {
    return;
  }
  m_readerDataGeneration.fetch_add(1, std::memory_order_relaxed);
}

// HomeKey CONTROL FLOW command, "transaction succeeded" variant.
// Layout: CLA=0x80, INS=0x3C, P1=0x01 (success), P2=0x00, no Lc/Le.
static bool isControlFlowSuccess(const std::vector<uint8_t>& apdu) {
  return apdu.size() == 4 && apdu[0] == 0x80 && apdu[1] == 0x3C &&
         apdu[2] == 0x01;
}

std::unique_ptr<ddk::Session> NfcManager::buildAuthSession() {
  std::function<bool(std::vector<uint8_t>&, std::vector<uint8_t>&)> nfcFn =
      [this](std::vector<uint8_t>& send, std::vector<uint8_t>& recv) -> bool {
        if (!m_reader || send.size() > 255) {
          return false;
        }
        const bool ok = m_reader->exchangeApdu(send, recv, 1000);

        // CONTROL FLOW "success" (80 3C 01 00) is the courtesy notification
        // that tells the phone the transaction ended well -- it carries no
        // security value and by the time it is sent the endpoint is already
        // cryptographically authenticated. The phone is usually being lifted
        // off the reader at that exact moment, so this is the single APDU
        // most likely to die with an RF error, and losing its acknowledgement
        // used to fail the whole flow and leave the door shut after a
        // perfectly good tap. Treat a reader-level loss here as delivered.
        // Note this cannot turn a rejected tap into an open door: the failure
        // notification is 80 3C 00 00 and its answer is discarded upstream.
        if (!ok && isControlFlowSuccess(send)) {
          ESP_LOGW(TAG,
                   "CONTROL FLOW ack lost at reader level; endpoint is already "
                   "authenticated, completing the transaction anyway.");
          recv = {0x90, 0x00};
          return true;
        }

        // Diagnostic: a reply that is only a status word (no payload) is
        // otherwise logged upstream as "<empty>", hiding whether the phone
        // answered e.g. 6985 (not armed) or the reader reported an RF error.
        if (ok && recv.size() <= 2) {
          ESP_LOGW(TAG, "APDU %02X%02X answered with status-only reply: %s",
                   send.size() > 0 ? send[0] : 0, send.size() > 1 ? send[1] : 0,
                   recv.empty() ? "(none)" : fmt::format("{:02X}", fmt::join(recv, "")).c_str());
        } else if (!ok) {
          m_linkError = true;
          ESP_LOGW(TAG, "APDU %02X%02X exchange failed at reader level",
                   send.size() > 0 ? send[0] : 0, send.size() > 1 ? send[1] : 0);
        }
        return ok;
      };
  ddk::SessionConfig config;
  config.target_flow = authFlow;
  // Constructing the Session runs mbedTLS P-256 ephemeral key generation
  // (~50 ms on ESP32) -- the cost precompute moves off the tap path.
  return std::make_unique<ddk::Session>(
      std::make_shared<ddk::NfcChannel>(nfcFn), m_readerDataManager, config);
}

/**
 * @brief Construct and initialize an NfcManager, set up ECP data and event wiring.
 *
 * Initializes internal state, registers the NFC bus topic, and subscribes to HomeKit/internal
 * events so that ACCESSDATA_CHANGED updates ECP data and invalidates the auth cache, and
 * DEBUG_AUTH_FLOW updates the debug authentication flow when received.
 *
 * @param readerDataManager Reference to the ReaderDataManager used to read and persist reader data.
 * @param nfcGpioPins Four GPIO pin numbers used for SPI communication (SS/CS, SCK, MISO, MOSI).
 * @param nfcReaderType 0 = PN532 (SPI), 1 = PN7160, 2 = ST25R3916 (I2C).
 * @param nfcIrqPin IRQ pin for PN7160 (255 = unset).
 * @param nfcVenPin VEN pin for PN7160 (255 = unset).
 * @param hkAuthPrecomputeEnabled If true, enables HomeKit authentication precompute behavior.
 * @param nfcFastPollingEnabled If true, shortens the delay between polling iterations.
 */
NfcManager::NfcManager(NvsCredentialStore& readerDataManager,
                       const std::array<uint8_t, 4> &nfcGpioPins,
                       uint8_t nfcReaderType,
                       uint8_t nfcIrqPin,
                       uint8_t nfcVenPin,
                       bool hkAuthPrecomputeEnabled,
                       bool nfcFastPollingEnabled)
    : nfcGpioPins(nfcGpioPins),
      m_nfcReaderType(nfcReaderType),
      m_nfcIrqPin(nfcIrqPin),
      m_nfcVenPin(nfcVenPin),
      m_readerDataManager(readerDataManager),
      m_hkAuthPrecomputeEnabled(hkAuthPrecomputeEnabled),
      m_nfcFastPollingEnabled(nfcFastPollingEnabled),
      m_pollingTaskHandle(nullptr),
      m_retryTaskHandle(nullptr)
{
  std::copy(ECP_HEAD, ECP_HEAD + 8, m_ecpData.begin());
  if (nfcReaderType == ST25R3916) {
    pinAllocations.emplace(PinFunctions::SDA, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[0]), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::I2cSda, GPIOAllocator::PinConsumer::Nfc, "I2C_SDA"));
    pinAllocations.emplace(PinFunctions::SCL, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[1]), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::I2cScl, GPIOAllocator::PinConsumer::Nfc, "I2C_SCL"));
  } else {
    pinAllocations.emplace(PinFunctions::SS, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[0]), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::SpiCs, GPIOAllocator::PinConsumer::Nfc, "SPI2_SS"));
    pinAllocations.emplace(PinFunctions::SCK, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[1]), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::SpiSck, GPIOAllocator::PinConsumer::Nfc, "SPI2_SCK"));
    pinAllocations.emplace(PinFunctions::MISO, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[2]), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::SpiMiso, GPIOAllocator::PinConsumer::Nfc, "SPI2_MISO"));
    pinAllocations.emplace(PinFunctions::MOSI, GPIOAllocator::instance().acquire(gpio_num_t(nfcGpioPins[3]), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::SpiMosi, GPIOAllocator::PinConsumer::Nfc, "SPI2_MOSI"));
  }
  if (nfcReaderType == PN7160){
    if(nfcIrqPin != 255)
      pinAllocations.emplace(PinFunctions::IRQ, GPIOAllocator::instance().acquire(gpio_num_t(nfcIrqPin), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::NfcIrq, GPIOAllocator::PinConsumer::Nfc, "NFC_IRQ"));
    if(nfcVenPin != 255)
      pinAllocations.emplace(PinFunctions::VEN, GPIOAllocator::instance().acquire(gpio_num_t(nfcVenPin), GPIO_MODE_DISABLE, GPIOAllocator::PinRole::NfcVen, GPIOAllocator::PinConsumer::Nfc, "NFC_VEN"));
  }
  for(auto &p : pinAllocations){
    if(!p.second.has_value()){
      ESP_LOGW(TAG, "Could not acquire GPIO Pin for '%s' with error '%s'", pin_function_str(p.first), GPIOAllocator::error_str(p.second.error()));
    }
  }
  m_hk_event = AppEventLoop::subscribe(HK_EVENT, HK_INTERNAL_EVENT, [&](const uint8_t* data, size_t size){
    if(size == 0 || data == nullptr) return;
    std::span<const uint8_t> payload(data, size);
    std::error_code ec;
    HomekitEvent hk_event = alpaca::deserialize<HomekitEvent>(payload, ec);
    if(ec) { ESP_LOGE(TAG, "Failed to deserialize HomeKit event: %s", ec.message().c_str()); return; }
    switch(hk_event.type) {
      case ACCESSDATA_CHANGED: {
        const auto& readerGid = readerDataManager.reader_identity().group_identifier;
        if (readerGid.size() == 8) {
            std::copy(ECP_HEAD, ECP_HEAD + 8, m_ecpData.begin());
            memcpy(m_ecpData.data() + 8, readerGid.data(), 8);
            Utils::crc16a(m_ecpData.data(), 16, m_ecpData.data() + 16);
        } else {
            std::fill(m_ecpData.begin(), m_ecpData.end(), 0);
        }
        
        m_reconfigRequested.store(true, std::memory_order_release);
        invalidateAuthCache();
      }
      break;
      case DEBUG_AUTH_FLOW: {
        EventValueChanged s = alpaca::deserialize<EventValueChanged>(hk_event.data, ec);
        if(!ec){
          authFlow = ddk::Flow(s.newValue);
          // Cached sessions bake target_flow into their SessionConfig at
          // construction, so drop any built for the previous flow.
          invalidateAuthCache();
        } else {
          ESP_LOGE(TAG, "Failed to deserialize debug auth flow event: %s", ec.message().c_str());
          return;
        }
      }
      break;
      default:
        break;
    }
  });
}

NfcManager::~NfcManager() {
#if CONFIG_PM_ENABLE
  if (m_pmLock) {
    esp_pm_lock_delete(m_pmLock);
    m_pmLock = nullptr;
  }
#endif
}

/**
 * @brief Initialize the selected NFC reader and start the NFC polling task.
 *
 * Instantiates the correct reader implementation (PN532 or PN7160) and launches
 * the background task that drives NFC polling.
 *
 * @return `true` if the NFC polling task was started, `false` otherwise.
 */
bool NfcManager::begin() {
    const auto& readerGid = m_readerDataManager.reader_identity().group_identifier;
    if (readerGid.size() == 8) {
        memcpy(m_ecpData.data() + 8, readerGid.data(), 8);
        Utils::crc16a(m_ecpData.data(), 16, m_ecpData.data() + 16);
    } else if(readerGid.size() == 0) {
        std::fill(m_ecpData.begin(), m_ecpData.end(), 0);
    }
    if (m_nfcReaderType == 0) {
        m_reader = std::make_unique<Pn532Reader>(nfcGpioPins, m_ecpData);
        ESP_LOGI(TAG, "Using PN532 reader");
    } else if (m_nfcReaderType == 1) {
    	 if (m_nfcIrqPin == 255 || m_nfcVenPin == 255) {
				 ESP_LOGE(TAG, "PN7160 selected but IRQ/VEN pins are unset");
				 return false;
			 }
			m_reader = std::make_unique<Pn7160Reader>(nfcGpioPins, m_nfcIrqPin, m_nfcVenPin, m_ecpData);
			ESP_LOGI(TAG, "Using PN7160 reader");
    } else if (m_nfcReaderType == 2) {
        // I2C: nfcGpioPins[0] = SDA, [1] = SCL. Entries [2]/[3] are unused.
        // Checked here for the same reason the PN7160 branch checks IRQ/VEN:
        // otherwise an unconfigured device reaches i2c_new_master_bus() with
        // sda_io_num = 255 and reports only a generic driver argument error.
        if (nfcGpioPins[0] == 255 || nfcGpioPins[1] == 255) {
            ESP_LOGE(TAG, "ST25R3916 selected but SDA/SCL pins are unset");
            return false;
        }
        m_reader = std::make_unique<St25r3916Reader>(nfcGpioPins, m_ecpData);
        ESP_LOGI(TAG, "Using ST25R3916 reader (I2C)");
    } else {
    	ESP_LOGE(TAG, "Unsupported NFC reader type: %u", m_nfcReaderType);
    	return false;
    }
#if CONFIG_PM_ENABLE
    if (!m_pmLock &&
        esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0, "nfc_txn", &m_pmLock) != ESP_OK) {
        // Not fatal: without it the tap still works, it just runs with DFS
        // free to change the clocks underneath it.
        ESP_LOGW(TAG, "Could not create the NFC power-management lock.");
        m_pmLock = nullptr;
    }
#endif
    ESP_LOGI(TAG, "Auth precompute %s.", m_hkAuthPrecomputeEnabled ? "enabled" : "disabled");
    ESP_LOGI(TAG, "NFC fast polling: %s", m_nfcFastPollingEnabled ? "enabled" : "disabled");
    ESP_LOGI(TAG, "Starting NFC polling task...");
		BaseType_t ok = xTaskCreateUniversal(
				pollingTaskEntry, "nfc_poll_task", 8192, this, 4, &m_pollingTaskHandle, 1);
		if (ok != pdPASS || !m_pollingTaskHandle) {
			ESP_LOGE(TAG, "Failed to create NFC polling task.");
			return false;
		}
		return true;
}

/**
 * @brief Initialize the selected NFC reader and refresh ECP data.
 *
 * Delegates to the active reader's init() method. On success, updates the manager's
 * ECP data buffer.
 *
 * @return `true` if the reader was successfully initialized and ECP data updated, `false` otherwise.
 */
bool NfcManager::initializeReader() {
    if (!m_reader) {
        ESP_LOGE(TAG, "No reader instance available.");
        return false;
    }
    if (!m_reader->init()) {
    		err:
        ESP_LOGE(TAG, "Reader initialization failed.");
        return false;
    }
		if (!m_reader->beginDiscovery()){goto err;}
    ESP_LOGI(TAG, "Reader initialized. Waiting for tags...");
    return true;
}

/**
 * @brief FreeRTOS task entry that dispatches to an instance's polling loop.
 *
 * This static function is used as a task entry point and calls the associated
 * NfcManager instance's pollingTask method.
 *
 * @param instance Pointer to the NfcManager instance whose pollingTask will be executed.
 */
void NfcManager::pollingTaskEntry(void* instance) {
    static_cast<NfcManager*>(instance)->pollingTask();
}

/**
 * @brief Main NFC polling loop that monitors the reader and dispatches tag handling.
 *
 * @details Initializes the NFC reader and then runs indefinitely, repeatedly
 * checking the reader's responsiveness and polling for passive ISO14443A tags.
 * If the reader becomes unresponsive, this task schedules a reconnection retry
 * and suspends itself. When a tag is detected, it invokes the tag handling path
 * and waits for the tag to be removed before continuing normal polling.
 */
void NfcManager::pollingTask() {
    if (!initializeReader()) {
    	while (true) {
    		if (initializeReader()) {
    			ESP_LOGI(TAG, "Reader reconnected successfully.");
    			break;
    		}
    		ESP_LOGW(TAG, "Reconnect attempt failed. Retrying in 5 seconds...");
    		vTaskDelay(pdMS_TO_TICKS(5000));
    	}
    }

