Rocontento/HomeKey-ESP32/main/NfcManager.cpp
    // Host-side cap on how long we wait for InListPassiveTarget to come back.
    // Passive activation retries are 0, so the PN532 makes a single attempt
    // and returns almost immediately; this only bounds a wedged reader.
    const uint16_t passiveTargetTimeoutMs = 150;
    const TickType_t pollDelayTicks =
        pdMS_TO_TICKS(m_nfcFastPollingEnabled ? 5 : 100);
    std::vector<uint8_t> uid;

    ESP_LOGI(TAG,
             "NFC poll tuning active: delay=%lu ms, passiveTimeout=%u ms",
             static_cast<unsigned long>(pollDelayTicks * portTICK_PERIOD_MS),
             static_cast<unsigned int>(passiveTargetTimeoutMs));

    while (true) {
        if (m_reconfigRequested.exchange(false, std::memory_order_acq_rel)) {
          ESP_LOGI(TAG, "ECP Frame update requested...");
          if (m_reader) {
              if (!m_reader->updateECP()) {
                  ESP_LOGE(TAG, "ECP update failed; performing full reader re-initialization.");
                  m_reader->stop();
                  if (!initializeReader()) {
                      vTaskDelay(pdMS_TO_TICKS(1000));
                      continue;
                  }
              }
          }
        }

        if (m_hkAuthPrecomputeEnabled) {
            const auto& identity = m_readerDataManager.reader_identity();
            const bool provisioned =
                identity.group_identifier.size() == 8 &&
                !identity.sub_identifier.empty() &&
                !identity.private_key.empty() &&
                !identity.public_key.empty();
            if (provisioned &&
                (!m_cachedSession ||
                 m_cachedSessionGeneration != m_readerDataGeneration.load(std::memory_order_relaxed))) {
                auto startTime = std::chrono::high_resolution_clock::now();
                m_cachedSession = buildAuthSession();
                m_cachedSessionGeneration = m_readerDataGeneration.load(std::memory_order_relaxed);
                ESP_LOGI(TAG, "Auth session precomputed in %lli ms.",
                         std::chrono::duration_cast<std::chrono::milliseconds>(
                             std::chrono::high_resolution_clock::now() - startTime)
                                 .count());
            }
        }
        if (!m_reader->healthCheck()) {
					ESP_LOGE(TAG, "NFC reader is unresponsive. Attempting to reconnect...");
					while (true) {
						if (initializeReader()) {
							ESP_LOGI(TAG, "Reader reconnected successfully.");
							break;
						}
						ESP_LOGW(TAG, "Reconnect attempt failed. Retrying in 5 seconds...");
						vTaskDelay(pdMS_TO_TICKS(5000));
					}
					continue;
        }

        // Post-transaction cooldown: after a HomeKey transaction the phone is
        // often still resting on the reader. Re-activating it immediately
        // starts a second transaction the phone will not complete (it must
        // leave and re-enter the field), which ends in a "flow failed" and an
        // error shown on the phone even though the door already opened.
        if (m_txnCooldownTicks != 0 &&
            (xTaskGetTickCount() - m_lastTxnTick) < m_txnCooldownTicks) {
            vTaskDelay(pollDelayTicks);
            continue;
        }
        m_txnCooldownTicks = 0;

        std::array<uint8_t,2> atqa;
        uint8_t sak;
        if (m_reader->pollForTag(uid, atqa, sak, passiveTargetTimeoutMs)) {
            ESP_LOGI(TAG, "NFC tag detected!");
            m_lastTxnOutcome = TxnOutcome::None;
            handleTagPresence(uid, atqa, sak);
            waitForTagRemoval();
            if (m_lastTxnOutcome != TxnOutcome::None) {
                m_lastTxnTick = xTaskGetTickCount();
                m_txnCooldownTicks = pdMS_TO_TICKS(
                    m_lastTxnOutcome == TxnOutcome::Success ? kPostSuccessCooldownMs
                                                            : kPostFailureCooldownMs);
                ESP_LOGD(TAG, "Post-transaction cooldown: %u ms",
                         (unsigned)(m_txnCooldownTicks * portTICK_PERIOD_MS));
            }
        }

        vTaskDelay(pollDelayTicks);
        taskYIELD();
    }
}

/**
 * @brief Handles a detected NFC tag by attempting to select the HomeKey applet and processing the tag accordingly.
 *
 * Attempts to select the HomeKey applet on the tag via an APDU select command; if selection succeeds, proceeds with
 * HomeKey authentication handling. If selection fails, reads the tag's UID/ATQA/SAK and processes it as a generic ISO14443A tag.
 * Logs the tag processing duration and releases the reader device state before returning.
 */
void NfcManager::handleTagPresence(const std::vector<uint8_t>& uid, const std::array<uint8_t,2>& atqa, const uint8_t& sak) {
    auto startTime = std::chrono::high_resolution_clock::now();

    // Everything below is one continuous RF exchange with the phone. Ask the
    // rest of the firmware to keep off the air until it is over (see
    // RfQuietWindow) and pin the clocks so dynamic frequency scaling cannot
    // re-lock a PLL between two APDUs. Both are released on every exit path.
    RfQuietWindow::Scope quiet;
#if CONFIG_PM_ENABLE
    struct PmLockScope {
        esp_pm_lock_handle_t h;
        explicit PmLockScope(esp_pm_lock_handle_t lock) : h(lock) {
            if (h) esp_pm_lock_acquire(h);
        }
        ~PmLockScope() { if (h) esp_pm_lock_release(h); }
        PmLockScope(const PmLockScope&) = delete;
        PmLockScope& operator=(const PmLockScope&) = delete;
    } pmLock(m_pmLock);
#endif

    const std::vector<uint8_t> selectAppletCmd = { 0x00, 0xA4, 0x04, 0x00, 0x07, 0xA0, 0x00, 0x00, 0x08, 0x58, 0x01, 0x01, 0x00 };

    // Link-level retry. With the PN532 the first exchange right after
    // activation sometimes dies with an RF protocol error (PN532 status 0x0B)
    // on the SELECT or on Auth0, while the very next attempt succeeds. Rather
    // than dropping the tag and letting the phone time out with an error on
    // screen, re-activate it and try again within ~100 ms. Only ISO-DEP tags
    // (SAK bit 0x20) are retried: a MIFARE Classic never answers an APDU and
    // must keep reaching the generic-tag path immediately.
    const bool isoDep = (sak & 0x20) != 0;
    const int maxAttempts = isoDep ? 1 + kLinkErrorRetries : 1;

    for (int attempt = 0; attempt < maxAttempts; ++attempt) {
        if (attempt > 0) {
            ESP_LOGW(TAG, "Link error, re-activating tag (retry %d/%d)", attempt, kLinkErrorRetries);
            m_reader->releaseTag();
            // A bare release was seen to leave the phone answering the next
            // SELECT with another protocol error; cycling the field forces a
            // clean activation instead.
            m_reader->resetField();
            vTaskDelay(pdMS_TO_TICKS(kLinkErrorRetryDelayMs));
            // After a field reset the phone takes a few hundred ms to re-arm
            // its card emulation, and a single poll was seen to miss it while
            // it was still resting on the reader. Keep polling for a while.
            std::vector<uint8_t> uid2;
            std::array<uint8_t,2> atqa2;
            uint8_t sak2 = 0;
            const TickType_t reacquireStart = xTaskGetTickCount();
            bool reacquired = false;
            while ((xTaskGetTickCount() - reacquireStart) * portTICK_PERIOD_MS < kLinkErrorReacquireMs) {
                if (m_reader->pollForTag(uid2, atqa2, sak2, 100)) {
                    reacquired = true;
                    break;
                }
                vTaskDelay(pdMS_TO_TICKS(20));
            }
            if (!reacquired) {
                ESP_LOGW(TAG, "Tag no longer present after %u ms, giving up retry.",
                         (unsigned)kLinkErrorReacquireMs);
                break;
            }
            ESP_LOGI(TAG, "Tag re-acquired after %u ms",
                     (unsigned)((xTaskGetTickCount() - reacquireStart) * portTICK_PERIOD_MS));
        }

        m_linkError = false;
        std::vector<uint8_t> response;
        const bool ok = m_reader->exchangeApdu(selectAppletCmd, response, 500);
        if (!ok) {
            // Reader-level failure (transport or PN532 error), the tag never
            // answered. Retry if we can; otherwise fall through to the generic
            // path below on the last attempt so behaviour for odd tags is kept.
            m_linkError = true;
            if (attempt + 1 < maxAttempts) continue;
            ESP_LOGW(TAG, "SELECT failed at reader level after %d attempt(s).", attempt + 1);
            ESP_LOGD(TAG, "Passive target UID: %s (%zu)", fmt::format("{:02X}", fmt::join(uid, "")).c_str(), uid.size());
            handleGenericTag(uid, atqa, sak);
            break;
        }

        // Check for success SW1=0x90, SW2=0x00
        if (response.size() >= 2 && response[response.size() - 2] == 0x90 && response[response.size() - 1] == 0x00) {
            ESP_LOG_BUFFER_HEX_LEVEL(TAG, response.data(), response.size(), ESP_LOG_DEBUG);
            ESP_LOGI(TAG, "HomeKey applet selected successfully.");
            m_linkError = false;
            handleHomeKeyAuth(response);
            // Auth failed because the link broke mid-flow (not because the
            // phone rejected us): run the whole thing again on a fresh
            // activation. The phone has not seen any control-flow command in
            // this case, so a new transaction is clean.
            if (m_lastTxnOutcome == TxnOutcome::Failure && m_linkError && attempt + 1 < maxAttempts) {
                continue;
            }
            break;
        }

        // The tag answered, just not with our applet: a real non-HomeKey tag.
        ESP_LOGI(TAG, "Not a HomeKey tag, or failed to select applet.");
        ESP_LOGD(TAG, "Passive target UID: %s (%zu)", fmt::format("{:02X}", fmt::join(uid, "")).c_str(), uid.size());
        handleGenericTag(uid, atqa, sak);
        break;
    }

    auto stopTime = std::chrono::high_resolution_clock::now();
    ESP_LOGI(TAG, "Total processing time: %lli ms", std::chrono::duration_cast<std::chrono::milliseconds>(stopTime - startTime).count());
    // Headroom check. This task runs mbedTLS P-256 operations (ECDH, ECDSA) on
    // top of the reader's frame buffers, and an overflow here would look
    // exactly like the observed symptom: a reboot part-way through a
    // transaction. Reported every time so a downward trend is visible.
    const UBaseType_t stackFreeWords = uxTaskGetStackHighWaterMark(nullptr);
    if (stackFreeWords < 512) {
      ESP_LOGW(TAG, "nfc task stack headroom LOW: %u bytes free",
               (unsigned)(stackFreeWords * sizeof(StackType_t)));
    } else {
      ESP_LOGD(TAG, "nfc task stack headroom: %u bytes free",
               (unsigned)(stackFreeWords * sizeof(StackType_t)));
    }
    ESP_LOGD(TAG, "heap: %u free, %u min-ever", (unsigned)esp_get_free_heap_size(),
             (unsigned)esp_get_minimum_free_heap_size());

