Rocontento/HomeKey-ESP32/main/NfcManager.cpp
}

/**
 * @brief Block until the active tag leaves the reader's RF field.
 *
 * Spins on `isTagStillPresent()` with a 60 ms delay between checks.  If the
 * tag is not removed within 10 seconds, the reader is force-released and the
 * function returns to avoid an infinite loop.
 */
void NfcManager::waitForTagRemoval() {
    if (!m_reader) return;
    TickType_t start = xTaskGetTickCount();
    while (m_reader->isTagStillPresent()) {
        if ((xTaskGetTickCount() - start) * portTICK_PERIOD_MS > 10000) {
            ESP_LOGW(TAG, "Tag removal wait timed out, forcing release.");
            m_reader->releaseTag();
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(60));
    }
    m_reader->releaseTag();
}

/**
 * @brief Attempt HomeKey authentication for the currently-present NFC tag.
 *
 * Performs the configured HomeKey authentication flow for the active tag and publishes a HOMEKEY_TAP
 * event describing the outcome. On successful authentication, stored reader data may be updated.
 *
 * If HomeKey precomputation is enabled, a precomputed authentication session may be consumed (when
 * generation matches current reader data); otherwise a fresh ("cold") authentication session is used.
 *
 * Side effects: may update ReaderDataManager, publish a HOMEKEY_TAP event on the NFC bus, and
 * reset the consumed precomputed session (rebuilt by the polling task).
 */
void NfcManager::handleHomeKeyAuth(const std::vector<uint8_t>& select_response) {
    auto publishAuthResult = [](
        const ddk::AuthOutcome& authResult,
        const std::vector<uint8_t>& readerId
    ) {
        if (authResult.state != ddk::FlowState::Failed) {
            ESP_LOGI(TAG, "HomeKey authentication successful!");
            EventHKTap s{.status = true, .issuerId = authResult.issuer->id, .endpointId = authResult.endpoint->id, .readerId = readerId };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
        } else {
            ESP_LOGW(TAG, "HomeKey authentication failed.");
            EventHKTap s{.status = false, .issuerId = {}, .endpointId = {}, .readerId = {} };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
        }
    };

    auto runAuth = [&](ddk::Profile& profile, ddk::Session& session) {
        auto startTime = std::chrono::high_resolution_clock::now();
        auto err = profile.validate_select(session, select_response);
        if (err != ddk::FailureReason::None) {
          ESP_LOGE(TAG, "Profile Rejected SELECT Response");
          return;
        }
        auto state = ddk::FlowState::Selected;
        while (state != ddk::FlowState::Done && state != ddk::FlowState::Failed) {
            state = profile.step(session, state);
        }

        auto outcome = profile.finalize(session);
        m_lastTxnOutcome = outcome ? TxnOutcome::Success : TxnOutcome::Failure;
        if (outcome) {
            ESP_LOGI(TAG, "Endpoint authenticated in %lli ms", std::chrono::duration_cast<std::chrono::milliseconds>(std::chrono::high_resolution_clock::now() - startTime).count());
            publishAuthResult(outcome, m_readerDataManager.reader_identity().sub_identifier);
        }
        // No extra control-flow command here: Profile::step already sent the
        // success/failure CONTROL FLOW, and a second one is answered 6A82.
    };

    auto authenticateCold = [&]() {
        auto session = buildAuthSession();
        auto profile = ddk::homekey::make_profile();
        runAuth(*profile, *session);
    };

    if (m_hkAuthPrecomputeEnabled) {
        const uint32_t genNow = m_readerDataGeneration.load(std::memory_order_relaxed);
        if (m_cachedSession && m_cachedSessionGeneration == genNow) {
            ESP_LOGI(TAG, "Auth cache hit (gen=%u).", genNow);
            auto profile = ddk::homekey::make_profile();
            runAuth(*profile, *m_cachedSession);
            m_cachedSession.reset();
            return;
        }
        ESP_LOGI(TAG, "Auth cache miss (gen=%u) -> cold init.", genNow);
    }
    authenticateCold();
}

/**
 * @brief Publish a TAG_TAP NFC event for a detected non-HomeKey (generic) tag.
 *
 * Constructs an EventTagTap containing the tag UID, ATQA, and SAK, serializes it
 * into an NfcEvent payload, and publishes the serialized event to the NFC event
 * topic.
 */
void NfcManager::handleGenericTag(const std::vector<uint8_t>& uid, const std::array<uint8_t,2>& atqa, const uint8_t& sak) {
    EventTagTap s{.uid = uid, .atqa = atqa, .sak = sak};
    std::vector<uint8_t> d;
    alpaca::serialize(s, d);
    NfcEvent event{.type=TAG_TAP, .data=d};
    std::vector<uint8_t> event_data;
    alpaca::serialize(event, event_data);
    AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
}
